Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_serial_flash/firmware/src/packs/ATSAMA5D29_DFP/component/xdmac.h
#define   XDMAC_CC_PERID_FLEXCOM4_TX_Val      _UINT32_(0x13)                                       /* (XDMAC_CC) FLEXCOM4_TX  */
#define   XDMAC_CC_PERID_FLEXCOM4_RX_Val      _UINT32_(0x14)                                       /* (XDMAC_CC) FLEXCOM4_RX  */
#define   XDMAC_CC_PERID_SSC0_TX_Val          _UINT32_(0x15)                                       /* (XDMAC_CC) SSC0_TX  */
#define   XDMAC_CC_PERID_SSC0_RX_Val          _UINT32_(0x16)                                       /* (XDMAC_CC) SSC0_RX  */
#define   XDMAC_CC_PERID_SSC1_TX_Val          _UINT32_(0x17)                                       /* (XDMAC_CC) SSC1_TX  */
#define   XDMAC_CC_PERID_SSC1_RX_Val          _UINT32_(0x18)                                       /* (XDMAC_CC) SSC1_RX  */
#define   XDMAC_CC_PERID_ADC_Val              _UINT32_(0x19)                                       /* (XDMAC_CC) ADC  */
#define   XDMAC_CC_PERID_AES_TX_Val           _UINT32_(0x1A)                                       /* (XDMAC_CC) AES_TX  */
#define   XDMAC_CC_PERID_AES_RX_Val           _UINT32_(0x1B)                                       /* (XDMAC_CC) AES_RX  */
#define   XDMAC_CC_PERID_TDES_TX_Val          _UINT32_(0x1C)                                       /* (XDMAC_CC) TDES_TX  */
#define   XDMAC_CC_PERID_TDES_RX_Val          _UINT32_(0x1D)                                       /* (XDMAC_CC) TDES_RX  */
#define   XDMAC_CC_PERID_SHA_Val              _UINT32_(0x1E)                                       /* (XDMAC_CC) SHA  */
#define   XDMAC_CC_PERID_I2SC0_TX_Val         _UINT32_(0x1F)                                       /* (XDMAC_CC) I2SC0_TX  */
#define   XDMAC_CC_PERID_I2SC0_RX_Val         _UINT32_(0x20)                                       /* (XDMAC_CC) I2SC0_RX  */
#define   XDMAC_CC_PERID_I2SC1_TX_Val         _UINT32_(0x21)                                       /* (XDMAC_CC) I2SC1_TX  */
#define   XDMAC_CC_PERID_I2SC1_RX_Val         _UINT32_(0x22)                                       /* (XDMAC_CC) I2SC1_RX  */
#define   XDMAC_CC_PERID_UART0_TX_Val         _UINT32_(0x23)                                       /* (XDMAC_CC) UART0_TX  */
#define   XDMAC_CC_PERID_UART0_RX_Val         _UINT32_(0x24)                                       /* (XDMAC_CC) UART0_RX  */
#define   XDMAC_CC_PERID_UART1_TX_Val         _UINT32_(0x25)                                       /* (XDMAC_CC) UART1_TX  */
#define   XDMAC_CC_PERID_UART1_RX_Val         _UINT32_(0x26)                                       /* (XDMAC_CC) UART1_RX  */
#define   XDMAC_CC_PERID_UART2_TX_Val         _UINT32_(0x27)                                       /* (XDMAC_CC) UART2_TX  */
#define   XDMAC_CC_PERID_UART2_RX_Val         _UINT32_(0x28)                                       /* (XDMAC_CC) UART2_RX  */
#define   XDMAC_CC_PERID_UART3_TX_Val         _UINT32_(0x29)                                       /* (XDMAC_CC) UART3_TX  */
#define   XDMAC_CC_PERID_UART3_RX_Val         _UINT32_(0x2A)                                       /* (XDMAC_CC) UART3_RX  */
#define   XDMAC_CC_PERID_UART4_TX_Val         _UINT32_(0x2B)                                       /* (XDMAC_CC) UART4_TX  */
#define   XDMAC_CC_PERID_UART4_RX_Val         _UINT32_(0x2C)                                       /* (XDMAC_CC) UART4_RX  */
#define   XDMAC_CC_PERID_TC0_Val              _UINT32_(0x2D)                                       /* (XDMAC_CC) TC0  */
#define   XDMAC_CC_PERID_TC1_Val              _UINT32_(0x2E)                                       /* (XDMAC_CC) TC1  */
#define   XDMAC_CC_PERID_CLASSD_Val           _UINT32_(0x2F)                                       /* (XDMAC_CC) CLASSD  */
#define   XDMAC_CC_PERID_QSPI1_TX_Val         _UINT32_(0x30)                                       /* (XDMAC_CC) QSPI1_TX  */
#define   XDMAC_CC_PERID_QSPI1_RX_Val         _UINT32_(0x31)                                       /* (XDMAC_CC) QSPI1_RX  */
#define   XDMAC_CC_PERID_PDMIC_Val            _UINT32_(0x32)                                       /* (XDMAC_CC) PDMIC  */
#define XDMAC_CC_PERID_THIHS0_TX              (XDMAC_CC_PERID_THIHS0_TX_Val << XDMAC_CC_PERID_Pos) /* (XDMAC_CC) TWIHS0_TX Position  */
#define XDMAC_CC_PERID_THIHS0_RX              (XDMAC_CC_PERID_THIHS0_RX_Val << XDMAC_CC_PERID_Pos) /* (XDMAC_CC) TWIHS0_RX Position  */
#define XDMAC_CC_PERID_THIHS1_TX              (XDMAC_CC_PERID_THIHS1_TX_Val << XDMAC_CC_PERID_Pos) /* (XDMAC_CC) TWIHS1_TX Position  */
#define XDMAC_CC_PERID_THIHS1_RX              (XDMAC_CC_PERID_THIHS1_RX_Val << XDMAC_CC_PERID_Pos) /* (XDMAC_CC) TWIHS1_RX Position  */
#define XDMAC_CC_PERID_QSPI0_TX               (XDMAC_CC_PERID_QSPI0_TX_Val << XDMAC_CC_PERID_Pos)  /* (XDMAC_CC) QSPI0_TX Position  */
#define XDMAC_CC_PERID_QSPI0_RX               (XDMAC_CC_PERID_QSPI0_RX_Val << XDMAC_CC_PERID_Pos)  /* (XDMAC_CC) QSPI0_RX Position  */
#define XDMAC_CC_PERID_SPI0_TX                (XDMAC_CC_PERID_SPI0_TX_Val << XDMAC_CC_PERID_Pos)   /* (XDMAC_CC) SPI0_TX Position  */
#define XDMAC_CC_PERID_SPI0_RX                (XDMAC_CC_PERID_SPI0_RX_Val << XDMAC_CC_PERID_Pos)   /* (XDMAC_CC) SPI0_RX Position  */
#define XDMAC_CC_PERID_SPI1_TX                (XDMAC_CC_PERID_SPI1_TX_Val << XDMAC_CC_PERID_Pos)   /* (XDMAC_CC) SPI1_TX Position  */
#define XDMAC_CC_PERID_SPI1_RX                (XDMAC_CC_PERID_SPI1_RX_Val << XDMAC_CC_PERID_Pos)   /* (XDMAC_CC) SPI1_RX Position  */
#define XDMAC_CC_PERID_PWM                    (XDMAC_CC_PERID_PWM_Val << XDMAC_CC_PERID_Pos)       /* (XDMAC_CC) PWM Position  */
#define XDMAC_CC_PERID_FLEXCOM0_TX            (XDMAC_CC_PERID_FLEXCOM0_TX_Val << XDMAC_CC_PERID_Pos) /* (XDMAC_CC) FLEXCOM0_TX Position  */
#define XDMAC_CC_PERID_FLEXCOM0_RX            (XDMAC_CC_PERID_FLEXCOM0_RX_Val << XDMAC_CC_PERID_Pos) /* (XDMAC_CC) FLEXCOM0_RX Position  */
#define XDMAC_CC_PERID_FLEXCOM1_TX            (XDMAC_CC_PERID_FLEXCOM1_TX_Val << XDMAC_CC_PERID_Pos) /* (XDMAC_CC) FLEXCOM1_TX Position  */
#define XDMAC_CC_PERID_FLEXCOM1_RX            (XDMAC_CC_PERID_FLEXCOM1_RX_Val << XDMAC_CC_PERID_Pos) /* (XDMAC_CC) FLEXCOM1_RX Position  */
#define XDMAC_CC_PERID_FLEXCOM2_TX            (XDMAC_CC_PERID_FLEXCOM2_TX_Val << XDMAC_CC_PERID_Pos) /* (XDMAC_CC) FLEXCOM2_TX Position  */
#define XDMAC_CC_PERID_FLEXCOM2_RX            (XDMAC_CC_PERID_FLEXCOM2_RX_Val << XDMAC_CC_PERID_Pos) /* (XDMAC_CC) FLEXCOM2_RX Position  */
#define XDMAC_CC_PERID_FLEXCOM3_TX            (XDMAC_CC_PERID_FLEXCOM3_TX_Val << XDMAC_CC_PERID_Pos) /* (XDMAC_CC) FLEXCOM3_TX Position  */
#define XDMAC_CC_PERID_FLEXCOM3_RX            (XDMAC_CC_PERID_FLEXCOM3_RX_Val << XDMAC_CC_PERID_Pos) /* (XDMAC_CC) FLEXCOM3_RX Position  */
#define XDMAC_CC_PERID_FLEXCOM4_TX            (XDMAC_CC_PERID_FLEXCOM4_TX_Val << XDMAC_CC_PERID_Pos) /* (XDMAC_CC) FLEXCOM4_TX Position  */
#define XDMAC_CC_PERID_FLEXCOM4_RX            (XDMAC_CC_PERID_FLEXCOM4_RX_Val << XDMAC_CC_PERID_Pos) /* (XDMAC_CC) FLEXCOM4_RX Position  */
#define XDMAC_CC_PERID_SSC0_TX                (XDMAC_CC_PERID_SSC0_TX_Val << XDMAC_CC_PERID_Pos)   /* (XDMAC_CC) SSC0_TX Position  */
#define XDMAC_CC_PERID_SSC0_RX                (XDMAC_CC_PERID_SSC0_RX_Val << XDMAC_CC_PERID_Pos)   /* (XDMAC_CC) SSC0_RX Position  */
#define XDMAC_CC_PERID_SSC1_TX                (XDMAC_CC_PERID_SSC1_TX_Val << XDMAC_CC_PERID_Pos)   /* (XDMAC_CC) SSC1_TX Position  */
#define XDMAC_CC_PERID_SSC1_RX                (XDMAC_CC_PERID_SSC1_RX_Val << XDMAC_CC_PERID_Pos)   /* (XDMAC_CC) SSC1_RX Position  */
#define XDMAC_CC_PERID_ADC                    (XDMAC_CC_PERID_ADC_Val << XDMAC_CC_PERID_Pos)       /* (XDMAC_CC) ADC Position  */
#define XDMAC_CC_PERID_AES_TX                 (XDMAC_CC_PERID_AES_TX_Val << XDMAC_CC_PERID_Pos)    /* (XDMAC_CC) AES_TX Position  */
#define XDMAC_CC_PERID_AES_RX                 (XDMAC_CC_PERID_AES_RX_Val << XDMAC_CC_PERID_Pos)    /* (XDMAC_CC) AES_RX Position  */
#define XDMAC_CC_PERID_TDES_TX                (XDMAC_CC_PERID_TDES_TX_Val << XDMAC_CC_PERID_Pos)   /* (XDMAC_CC) TDES_TX Position  */
#define XDMAC_CC_PERID_TDES_RX                (XDMAC_CC_PERID_TDES_RX_Val << XDMAC_CC_PERID_Pos)   /* (XDMAC_CC) TDES_RX Position  */
#define XDMAC_CC_PERID_SHA                    (XDMAC_CC_PERID_SHA_Val << XDMAC_CC_PERID_Pos)       /* (XDMAC_CC) SHA Position  */
#define XDMAC_CC_PERID_I2SC0_TX               (XDMAC_CC_PERID_I2SC0_TX_Val << XDMAC_CC_PERID_Pos)  /* (XDMAC_CC) I2SC0_TX Position  */
#define XDMAC_CC_PERID_I2SC0_RX               (XDMAC_CC_PERID_I2SC0_RX_Val << XDMAC_CC_PERID_Pos)  /* (XDMAC_CC) I2SC0_RX Position  */
#define XDMAC_CC_PERID_I2SC1_TX               (XDMAC_CC_PERID_I2SC1_TX_Val << XDMAC_CC_PERID_Pos)  /* (XDMAC_CC) I2SC1_TX Position  */
#define XDMAC_CC_PERID_I2SC1_RX               (XDMAC_CC_PERID_I2SC1_RX_Val << XDMAC_CC_PERID_Pos)  /* (XDMAC_CC) I2SC1_RX Position  */
#define XDMAC_CC_PERID_UART0_TX               (XDMAC_CC_PERID_UART0_TX_Val << XDMAC_CC_PERID_Pos)  /* (XDMAC_CC) UART0_TX Position  */
#define XDMAC_CC_PERID_UART0_RX               (XDMAC_CC_PERID_UART0_RX_Val << XDMAC_CC_PERID_Pos)  /* (XDMAC_CC) UART0_RX Position  */
#define XDMAC_CC_PERID_UART1_TX               (XDMAC_CC_PERID_UART1_TX_Val << XDMAC_CC_PERID_Pos)  /* (XDMAC_CC) UART1_TX Position  */
#define XDMAC_CC_PERID_UART1_RX               (XDMAC_CC_PERID_UART1_RX_Val << XDMAC_CC_PERID_Pos)  /* (XDMAC_CC) UART1_RX Position  */
#define XDMAC_CC_PERID_UART2_TX               (XDMAC_CC_PERID_UART2_TX_Val << XDMAC_CC_PERID_Pos)  /* (XDMAC_CC) UART2_TX Position  */
#define XDMAC_CC_PERID_UART2_RX               (XDMAC_CC_PERID_UART2_RX_Val << XDMAC_CC_PERID_Pos)  /* (XDMAC_CC) UART2_RX Position  */
#define XDMAC_CC_PERID_UART3_TX               (XDMAC_CC_PERID_UART3_TX_Val << XDMAC_CC_PERID_Pos)  /* (XDMAC_CC) UART3_TX Position  */
#define XDMAC_CC_PERID_UART3_RX               (XDMAC_CC_PERID_UART3_RX_Val << XDMAC_CC_PERID_Pos)  /* (XDMAC_CC) UART3_RX Position  */
#define XDMAC_CC_PERID_UART4_TX               (XDMAC_CC_PERID_UART4_TX_Val << XDMAC_CC_PERID_Pos)  /* (XDMAC_CC) UART4_TX Position  */
#define XDMAC_CC_PERID_UART4_RX               (XDMAC_CC_PERID_UART4_RX_Val << XDMAC_CC_PERID_Pos)  /* (XDMAC_CC) UART4_RX Position  */
#define XDMAC_CC_PERID_TC0                    (XDMAC_CC_PERID_TC0_Val << XDMAC_CC_PERID_Pos)       /* (XDMAC_CC) TC0 Position  */
#define XDMAC_CC_PERID_TC1                    (XDMAC_CC_PERID_TC1_Val << XDMAC_CC_PERID_Pos)       /* (XDMAC_CC) TC1 Position  */
#define XDMAC_CC_PERID_CLASSD                 (XDMAC_CC_PERID_CLASSD_Val << XDMAC_CC_PERID_Pos)    /* (XDMAC_CC) CLASSD Position  */
#define XDMAC_CC_PERID_QSPI1_TX               (XDMAC_CC_PERID_QSPI1_TX_Val << XDMAC_CC_PERID_Pos)  /* (XDMAC_CC) QSPI1_TX Position  */
#define XDMAC_CC_PERID_QSPI1_RX               (XDMAC_CC_PERID_QSPI1_RX_Val << XDMAC_CC_PERID_Pos)  /* (XDMAC_CC) QSPI1_RX Position  */
#define XDMAC_CC_PERID_PDMIC                  (XDMAC_CC_PERID_PDMIC_Val << XDMAC_CC_PERID_Pos)     /* (XDMAC_CC) PDMIC Position  */
#define XDMAC_CC_Msk                          _UINT32_(0x7FEF7FF7)                                 /* (XDMAC_CC) Register Mask  */


/* -------- XDMAC_CDS_MSP : (XDMAC Offset: 0x2C) (R/W 32) Channel Data Stride Memory Set Pattern -------- */
#define XDMAC_CDS_MSP_SDS_MSP_Pos             _UINT32_(0)                                          /* (XDMAC_CDS_MSP) Channel x Source Data stride or Memory Set Pattern Position */
#define XDMAC_CDS_MSP_SDS_MSP_Msk             (_UINT32_(0xFFFF) << XDMAC_CDS_MSP_SDS_MSP_Pos)      /* (XDMAC_CDS_MSP) Channel x Source Data stride or Memory Set Pattern Mask */
#define XDMAC_CDS_MSP_SDS_MSP(value)          (XDMAC_CDS_MSP_SDS_MSP_Msk & (_UINT32_(value) << XDMAC_CDS_MSP_SDS_MSP_Pos)) /* Assigment of value for SDS_MSP in the XDMAC_CDS_MSP register */
#define XDMAC_CDS_MSP_DDS_MSP_Pos             _UINT32_(16)                                         /* (XDMAC_CDS_MSP) Channel x Destination Data Stride or Memory Set Pattern Position */
#define XDMAC_CDS_MSP_DDS_MSP_Msk             (_UINT32_(0xFFFF) << XDMAC_CDS_MSP_DDS_MSP_Pos)      /* (XDMAC_CDS_MSP) Channel x Destination Data Stride or Memory Set Pattern Mask */
#define XDMAC_CDS_MSP_DDS_MSP(value)          (XDMAC_CDS_MSP_DDS_MSP_Msk & (_UINT32_(value) << XDMAC_CDS_MSP_DDS_MSP_Pos)) /* Assigment of value for DDS_MSP in the XDMAC_CDS_MSP register */
#define XDMAC_CDS_MSP_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (XDMAC_CDS_MSP) Register Mask  */


/* -------- XDMAC_CSUS : (XDMAC Offset: 0x30) (R/W 32) Channel Source Microblock Stride -------- */
#define XDMAC_CSUS_SUBS_Pos                   _UINT32_(0)                                          /* (XDMAC_CSUS) Channel x Source Microblock Stride Position */
#define XDMAC_CSUS_SUBS_Msk                   (_UINT32_(0xFFFFFF) << XDMAC_CSUS_SUBS_Pos)          /* (XDMAC_CSUS) Channel x Source Microblock Stride Mask */
#define XDMAC_CSUS_SUBS(value)                (XDMAC_CSUS_SUBS_Msk & (_UINT32_(value) << XDMAC_CSUS_SUBS_Pos)) /* Assigment of value for SUBS in the XDMAC_CSUS register */
#define XDMAC_CSUS_Msk                        _UINT32_(0x00FFFFFF)                                 /* (XDMAC_CSUS) Register Mask  */


