Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_serial_flash/firmware/src/packs/ATSAMA5D29_DFP/component/xdmac.h
#define XDMAC_GIM_IM_Pos                      _UINT32_(0)                                          /* (XDMAC_GIM Position) XDMAC Channel x5 Interrupt Mask Bit */
#define XDMAC_GIM_IM_Msk                      (_UINT32_(0xFFFF) << XDMAC_GIM_IM_Pos)               /* (XDMAC_GIM Mask) IM */
#define XDMAC_GIM_IM(value)                   (XDMAC_GIM_IM_Msk & (_UINT32_(value) << XDMAC_GIM_IM_Pos)) 

/* -------- XDMAC_GIS : (XDMAC Offset: 0x18) ( R/ 32) Global Interrupt Status Register -------- */
#define XDMAC_GIS_IS0_Pos                     _UINT32_(0)                                          /* (XDMAC_GIS) XDMAC Channel 0 Interrupt Status Bit Position */
#define XDMAC_GIS_IS0_Msk                     (_UINT32_(0x1) << XDMAC_GIS_IS0_Pos)                 /* (XDMAC_GIS) XDMAC Channel 0 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS0(value)                  (XDMAC_GIS_IS0_Msk & (_UINT32_(value) << XDMAC_GIS_IS0_Pos)) /* Assigment of value for IS0 in the XDMAC_GIS register */
#define XDMAC_GIS_IS1_Pos                     _UINT32_(1)                                          /* (XDMAC_GIS) XDMAC Channel 1 Interrupt Status Bit Position */
#define XDMAC_GIS_IS1_Msk                     (_UINT32_(0x1) << XDMAC_GIS_IS1_Pos)                 /* (XDMAC_GIS) XDMAC Channel 1 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS1(value)                  (XDMAC_GIS_IS1_Msk & (_UINT32_(value) << XDMAC_GIS_IS1_Pos)) /* Assigment of value for IS1 in the XDMAC_GIS register */
#define XDMAC_GIS_IS2_Pos                     _UINT32_(2)                                          /* (XDMAC_GIS) XDMAC Channel 2 Interrupt Status Bit Position */
#define XDMAC_GIS_IS2_Msk                     (_UINT32_(0x1) << XDMAC_GIS_IS2_Pos)                 /* (XDMAC_GIS) XDMAC Channel 2 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS2(value)                  (XDMAC_GIS_IS2_Msk & (_UINT32_(value) << XDMAC_GIS_IS2_Pos)) /* Assigment of value for IS2 in the XDMAC_GIS register */
#define XDMAC_GIS_IS3_Pos                     _UINT32_(3)                                          /* (XDMAC_GIS) XDMAC Channel 3 Interrupt Status Bit Position */
#define XDMAC_GIS_IS3_Msk                     (_UINT32_(0x1) << XDMAC_GIS_IS3_Pos)                 /* (XDMAC_GIS) XDMAC Channel 3 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS3(value)                  (XDMAC_GIS_IS3_Msk & (_UINT32_(value) << XDMAC_GIS_IS3_Pos)) /* Assigment of value for IS3 in the XDMAC_GIS register */
#define XDMAC_GIS_IS4_Pos                     _UINT32_(4)                                          /* (XDMAC_GIS) XDMAC Channel 4 Interrupt Status Bit Position */
#define XDMAC_GIS_IS4_Msk                     (_UINT32_(0x1) << XDMAC_GIS_IS4_Pos)                 /* (XDMAC_GIS) XDMAC Channel 4 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS4(value)                  (XDMAC_GIS_IS4_Msk & (_UINT32_(value) << XDMAC_GIS_IS4_Pos)) /* Assigment of value for IS4 in the XDMAC_GIS register */
#define XDMAC_GIS_IS5_Pos                     _UINT32_(5)                                          /* (XDMAC_GIS) XDMAC Channel 5 Interrupt Status Bit Position */
#define XDMAC_GIS_IS5_Msk                     (_UINT32_(0x1) << XDMAC_GIS_IS5_Pos)                 /* (XDMAC_GIS) XDMAC Channel 5 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS5(value)                  (XDMAC_GIS_IS5_Msk & (_UINT32_(value) << XDMAC_GIS_IS5_Pos)) /* Assigment of value for IS5 in the XDMAC_GIS register */
#define XDMAC_GIS_IS6_Pos                     _UINT32_(6)                                          /* (XDMAC_GIS) XDMAC Channel 6 Interrupt Status Bit Position */
#define XDMAC_GIS_IS6_Msk                     (_UINT32_(0x1) << XDMAC_GIS_IS6_Pos)                 /* (XDMAC_GIS) XDMAC Channel 6 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS6(value)                  (XDMAC_GIS_IS6_Msk & (_UINT32_(value) << XDMAC_GIS_IS6_Pos)) /* Assigment of value for IS6 in the XDMAC_GIS register */
#define XDMAC_GIS_IS7_Pos                     _UINT32_(7)                                          /* (XDMAC_GIS) XDMAC Channel 7 Interrupt Status Bit Position */
#define XDMAC_GIS_IS7_Msk                     (_UINT32_(0x1) << XDMAC_GIS_IS7_Pos)                 /* (XDMAC_GIS) XDMAC Channel 7 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS7(value)                  (XDMAC_GIS_IS7_Msk & (_UINT32_(value) << XDMAC_GIS_IS7_Pos)) /* Assigment of value for IS7 in the XDMAC_GIS register */
#define XDMAC_GIS_IS8_Pos                     _UINT32_(8)                                          /* (XDMAC_GIS) XDMAC Channel 8 Interrupt Status Bit Position */
#define XDMAC_GIS_IS8_Msk                     (_UINT32_(0x1) << XDMAC_GIS_IS8_Pos)                 /* (XDMAC_GIS) XDMAC Channel 8 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS8(value)                  (XDMAC_GIS_IS8_Msk & (_UINT32_(value) << XDMAC_GIS_IS8_Pos)) /* Assigment of value for IS8 in the XDMAC_GIS register */
#define XDMAC_GIS_IS9_Pos                     _UINT32_(9)                                          /* (XDMAC_GIS) XDMAC Channel 9 Interrupt Status Bit Position */
#define XDMAC_GIS_IS9_Msk                     (_UINT32_(0x1) << XDMAC_GIS_IS9_Pos)                 /* (XDMAC_GIS) XDMAC Channel 9 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS9(value)                  (XDMAC_GIS_IS9_Msk & (_UINT32_(value) << XDMAC_GIS_IS9_Pos)) /* Assigment of value for IS9 in the XDMAC_GIS register */
#define XDMAC_GIS_IS10_Pos                    _UINT32_(10)                                         /* (XDMAC_GIS) XDMAC Channel 10 Interrupt Status Bit Position */
#define XDMAC_GIS_IS10_Msk                    (_UINT32_(0x1) << XDMAC_GIS_IS10_Pos)                /* (XDMAC_GIS) XDMAC Channel 10 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS10(value)                 (XDMAC_GIS_IS10_Msk & (_UINT32_(value) << XDMAC_GIS_IS10_Pos)) /* Assigment of value for IS10 in the XDMAC_GIS register */
#define XDMAC_GIS_IS11_Pos                    _UINT32_(11)                                         /* (XDMAC_GIS) XDMAC Channel 11 Interrupt Status Bit Position */
#define XDMAC_GIS_IS11_Msk                    (_UINT32_(0x1) << XDMAC_GIS_IS11_Pos)                /* (XDMAC_GIS) XDMAC Channel 11 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS11(value)                 (XDMAC_GIS_IS11_Msk & (_UINT32_(value) << XDMAC_GIS_IS11_Pos)) /* Assigment of value for IS11 in the XDMAC_GIS register */
#define XDMAC_GIS_IS12_Pos                    _UINT32_(12)                                         /* (XDMAC_GIS) XDMAC Channel 12 Interrupt Status Bit Position */
#define XDMAC_GIS_IS12_Msk                    (_UINT32_(0x1) << XDMAC_GIS_IS12_Pos)                /* (XDMAC_GIS) XDMAC Channel 12 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS12(value)                 (XDMAC_GIS_IS12_Msk & (_UINT32_(value) << XDMAC_GIS_IS12_Pos)) /* Assigment of value for IS12 in the XDMAC_GIS register */
#define XDMAC_GIS_IS13_Pos                    _UINT32_(13)                                         /* (XDMAC_GIS) XDMAC Channel 13 Interrupt Status Bit Position */
#define XDMAC_GIS_IS13_Msk                    (_UINT32_(0x1) << XDMAC_GIS_IS13_Pos)                /* (XDMAC_GIS) XDMAC Channel 13 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS13(value)                 (XDMAC_GIS_IS13_Msk & (_UINT32_(value) << XDMAC_GIS_IS13_Pos)) /* Assigment of value for IS13 in the XDMAC_GIS register */
#define XDMAC_GIS_IS14_Pos                    _UINT32_(14)                                         /* (XDMAC_GIS) XDMAC Channel 14 Interrupt Status Bit Position */
#define XDMAC_GIS_IS14_Msk                    (_UINT32_(0x1) << XDMAC_GIS_IS14_Pos)                /* (XDMAC_GIS) XDMAC Channel 14 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS14(value)                 (XDMAC_GIS_IS14_Msk & (_UINT32_(value) << XDMAC_GIS_IS14_Pos)) /* Assigment of value for IS14 in the XDMAC_GIS register */
#define XDMAC_GIS_IS15_Pos                    _UINT32_(15)                                         /* (XDMAC_GIS) XDMAC Channel 15 Interrupt Status Bit Position */
#define XDMAC_GIS_IS15_Msk                    (_UINT32_(0x1) << XDMAC_GIS_IS15_Pos)                /* (XDMAC_GIS) XDMAC Channel 15 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS15(value)                 (XDMAC_GIS_IS15_Msk & (_UINT32_(value) << XDMAC_GIS_IS15_Pos)) /* Assigment of value for IS15 in the XDMAC_GIS register */
#define XDMAC_GIS_Msk                         _UINT32_(0x0000FFFF)                                 /* (XDMAC_GIS) Register Mask  */

#define XDMAC_GIS_IS_Pos                      _UINT32_(0)                                          /* (XDMAC_GIS Position) XDMAC Channel x5 Interrupt Status Bit */
#define XDMAC_GIS_IS_Msk                      (_UINT32_(0xFFFF) << XDMAC_GIS_IS_Pos)               /* (XDMAC_GIS Mask) IS */
#define XDMAC_GIS_IS(value)                   (XDMAC_GIS_IS_Msk & (_UINT32_(value) << XDMAC_GIS_IS_Pos)) 

/* -------- XDMAC_GE : (XDMAC Offset: 0x1C) ( /W 32) Global Channel Enable Register -------- */
#define XDMAC_GE_EN0_Pos                      _UINT32_(0)                                          /* (XDMAC_GE) XDMAC Channel 0 Enable Bit Position */
#define XDMAC_GE_EN0_Msk                      (_UINT32_(0x1) << XDMAC_GE_EN0_Pos)                  /* (XDMAC_GE) XDMAC Channel 0 Enable Bit Mask */
#define XDMAC_GE_EN0(value)                   (XDMAC_GE_EN0_Msk & (_UINT32_(value) << XDMAC_GE_EN0_Pos)) /* Assigment of value for EN0 in the XDMAC_GE register */
#define XDMAC_GE_EN1_Pos                      _UINT32_(1)                                          /* (XDMAC_GE) XDMAC Channel 1 Enable Bit Position */
#define XDMAC_GE_EN1_Msk                      (_UINT32_(0x1) << XDMAC_GE_EN1_Pos)                  /* (XDMAC_GE) XDMAC Channel 1 Enable Bit Mask */
#define XDMAC_GE_EN1(value)                   (XDMAC_GE_EN1_Msk & (_UINT32_(value) << XDMAC_GE_EN1_Pos)) /* Assigment of value for EN1 in the XDMAC_GE register */
#define XDMAC_GE_EN2_Pos                      _UINT32_(2)                                          /* (XDMAC_GE) XDMAC Channel 2 Enable Bit Position */
#define XDMAC_GE_EN2_Msk                      (_UINT32_(0x1) << XDMAC_GE_EN2_Pos)                  /* (XDMAC_GE) XDMAC Channel 2 Enable Bit Mask */
#define XDMAC_GE_EN2(value)                   (XDMAC_GE_EN2_Msk & (_UINT32_(value) << XDMAC_GE_EN2_Pos)) /* Assigment of value for EN2 in the XDMAC_GE register */
#define XDMAC_GE_EN3_Pos                      _UINT32_(3)                                          /* (XDMAC_GE) XDMAC Channel 3 Enable Bit Position */
#define XDMAC_GE_EN3_Msk                      (_UINT32_(0x1) << XDMAC_GE_EN3_Pos)                  /* (XDMAC_GE) XDMAC Channel 3 Enable Bit Mask */
#define XDMAC_GE_EN3(value)                   (XDMAC_GE_EN3_Msk & (_UINT32_(value) << XDMAC_GE_EN3_Pos)) /* Assigment of value for EN3 in the XDMAC_GE register */
#define XDMAC_GE_EN4_Pos                      _UINT32_(4)                                          /* (XDMAC_GE) XDMAC Channel 4 Enable Bit Position */
#define XDMAC_GE_EN4_Msk                      (_UINT32_(0x1) << XDMAC_GE_EN4_Pos)                  /* (XDMAC_GE) XDMAC Channel 4 Enable Bit Mask */
#define XDMAC_GE_EN4(value)                   (XDMAC_GE_EN4_Msk & (_UINT32_(value) << XDMAC_GE_EN4_Pos)) /* Assigment of value for EN4 in the XDMAC_GE register */
#define XDMAC_GE_EN5_Pos                      _UINT32_(5)                                          /* (XDMAC_GE) XDMAC Channel 5 Enable Bit Position */
#define XDMAC_GE_EN5_Msk                      (_UINT32_(0x1) << XDMAC_GE_EN5_Pos)                  /* (XDMAC_GE) XDMAC Channel 5 Enable Bit Mask */
#define XDMAC_GE_EN5(value)                   (XDMAC_GE_EN5_Msk & (_UINT32_(value) << XDMAC_GE_EN5_Pos)) /* Assigment of value for EN5 in the XDMAC_GE register */
#define XDMAC_GE_EN6_Pos                      _UINT32_(6)                                          /* (XDMAC_GE) XDMAC Channel 6 Enable Bit Position */
#define XDMAC_GE_EN6_Msk                      (_UINT32_(0x1) << XDMAC_GE_EN6_Pos)                  /* (XDMAC_GE) XDMAC Channel 6 Enable Bit Mask */
#define XDMAC_GE_EN6(value)                   (XDMAC_GE_EN6_Msk & (_UINT32_(value) << XDMAC_GE_EN6_Pos)) /* Assigment of value for EN6 in the XDMAC_GE register */
#define XDMAC_GE_EN7_Pos                      _UINT32_(7)                                          /* (XDMAC_GE) XDMAC Channel 7 Enable Bit Position */
#define XDMAC_GE_EN7_Msk                      (_UINT32_(0x1) << XDMAC_GE_EN7_Pos)                  /* (XDMAC_GE) XDMAC Channel 7 Enable Bit Mask */
#define XDMAC_GE_EN7(value)                   (XDMAC_GE_EN7_Msk & (_UINT32_(value) << XDMAC_GE_EN7_Pos)) /* Assigment of value for EN7 in the XDMAC_GE register */
#define XDMAC_GE_EN8_Pos                      _UINT32_(8)                                          /* (XDMAC_GE) XDMAC Channel 8 Enable Bit Position */
#define XDMAC_GE_EN8_Msk                      (_UINT32_(0x1) << XDMAC_GE_EN8_Pos)                  /* (XDMAC_GE) XDMAC Channel 8 Enable Bit Mask */
#define XDMAC_GE_EN8(value)                   (XDMAC_GE_EN8_Msk & (_UINT32_(value) << XDMAC_GE_EN8_Pos)) /* Assigment of value for EN8 in the XDMAC_GE register */
#define XDMAC_GE_EN9_Pos                      _UINT32_(9)                                          /* (XDMAC_GE) XDMAC Channel 9 Enable Bit Position */
#define XDMAC_GE_EN9_Msk                      (_UINT32_(0x1) << XDMAC_GE_EN9_Pos)                  /* (XDMAC_GE) XDMAC Channel 9 Enable Bit Mask */
#define XDMAC_GE_EN9(value)                   (XDMAC_GE_EN9_Msk & (_UINT32_(value) << XDMAC_GE_EN9_Pos)) /* Assigment of value for EN9 in the XDMAC_GE register */
#define XDMAC_GE_EN10_Pos                     _UINT32_(10)                                         /* (XDMAC_GE) XDMAC Channel 10 Enable Bit Position */
#define XDMAC_GE_EN10_Msk                     (_UINT32_(0x1) << XDMAC_GE_EN10_Pos)                 /* (XDMAC_GE) XDMAC Channel 10 Enable Bit Mask */
#define XDMAC_GE_EN10(value)                  (XDMAC_GE_EN10_Msk & (_UINT32_(value) << XDMAC_GE_EN10_Pos)) /* Assigment of value for EN10 in the XDMAC_GE register */
#define XDMAC_GE_EN11_Pos                     _UINT32_(11)                                         /* (XDMAC_GE) XDMAC Channel 11 Enable Bit Position */
#define XDMAC_GE_EN11_Msk                     (_UINT32_(0x1) << XDMAC_GE_EN11_Pos)                 /* (XDMAC_GE) XDMAC Channel 11 Enable Bit Mask */
#define XDMAC_GE_EN11(value)                  (XDMAC_GE_EN11_Msk & (_UINT32_(value) << XDMAC_GE_EN11_Pos)) /* Assigment of value for EN11 in the XDMAC_GE register */
#define XDMAC_GE_EN12_Pos                     _UINT32_(12)                                         /* (XDMAC_GE) XDMAC Channel 12 Enable Bit Position */
#define XDMAC_GE_EN12_Msk                     (_UINT32_(0x1) << XDMAC_GE_EN12_Pos)                 /* (XDMAC_GE) XDMAC Channel 12 Enable Bit Mask */
#define XDMAC_GE_EN12(value)                  (XDMAC_GE_EN12_Msk & (_UINT32_(value) << XDMAC_GE_EN12_Pos)) /* Assigment of value for EN12 in the XDMAC_GE register */
#define XDMAC_GE_EN13_Pos                     _UINT32_(13)                                         /* (XDMAC_GE) XDMAC Channel 13 Enable Bit Position */
#define XDMAC_GE_EN13_Msk                     (_UINT32_(0x1) << XDMAC_GE_EN13_Pos)                 /* (XDMAC_GE) XDMAC Channel 13 Enable Bit Mask */
#define XDMAC_GE_EN13(value)                  (XDMAC_GE_EN13_Msk & (_UINT32_(value) << XDMAC_GE_EN13_Pos)) /* Assigment of value for EN13 in the XDMAC_GE register */
#define XDMAC_GE_EN14_Pos                     _UINT32_(14)                                         /* (XDMAC_GE) XDMAC Channel 14 Enable Bit Position */
#define XDMAC_GE_EN14_Msk                     (_UINT32_(0x1) << XDMAC_GE_EN14_Pos)                 /* (XDMAC_GE) XDMAC Channel 14 Enable Bit Mask */
#define XDMAC_GE_EN14(value)                  (XDMAC_GE_EN14_Msk & (_UINT32_(value) << XDMAC_GE_EN14_Pos)) /* Assigment of value for EN14 in the XDMAC_GE register */
#define XDMAC_GE_EN15_Pos                     _UINT32_(15)                                         /* (XDMAC_GE) XDMAC Channel 15 Enable Bit Position */
#define XDMAC_GE_EN15_Msk                     (_UINT32_(0x1) << XDMAC_GE_EN15_Pos)                 /* (XDMAC_GE) XDMAC Channel 15 Enable Bit Mask */
#define XDMAC_GE_EN15(value)                  (XDMAC_GE_EN15_Msk & (_UINT32_(value) << XDMAC_GE_EN15_Pos)) /* Assigment of value for EN15 in the XDMAC_GE register */
#define XDMAC_GE_Msk                          _UINT32_(0x0000FFFF)                                 /* (XDMAC_GE) Register Mask  */

#define XDMAC_GE_EN_Pos                       _UINT32_(0)                                          /* (XDMAC_GE Position) XDMAC Channel x5 Enable Bit */
#define XDMAC_GE_EN_Msk                       (_UINT32_(0xFFFF) << XDMAC_GE_EN_Pos)                /* (XDMAC_GE Mask) EN */
#define XDMAC_GE_EN(value)                    (XDMAC_GE_EN_Msk & (_UINT32_(value) << XDMAC_GE_EN_Pos)) 

