Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_serial_flash/firmware/src/packs/ATSAMA5D29_DFP/component/xdmac.h
#define XDMAC_GRS_RS_Pos                      _UINT32_(0)                                          /* (XDMAC_GRS Position) XDMAC Channel x5 Read Suspend Bit */
#define XDMAC_GRS_RS_Msk                      (_UINT32_(0xFFFF) << XDMAC_GRS_RS_Pos)               /* (XDMAC_GRS Mask) RS */
#define XDMAC_GRS_RS(value)                   (XDMAC_GRS_RS_Msk & (_UINT32_(value) << XDMAC_GRS_RS_Pos)) 

/* -------- XDMAC_GWS : (XDMAC Offset: 0x2C) (R/W 32) Global Channel Write Suspend Register -------- */
#define XDMAC_GWS_WS0_Pos                     _UINT32_(0)                                          /* (XDMAC_GWS) XDMAC Channel 0 Write Suspend Bit Position */
#define XDMAC_GWS_WS0_Msk                     (_UINT32_(0x1) << XDMAC_GWS_WS0_Pos)                 /* (XDMAC_GWS) XDMAC Channel 0 Write Suspend Bit Mask */
#define XDMAC_GWS_WS0(value)                  (XDMAC_GWS_WS0_Msk & (_UINT32_(value) << XDMAC_GWS_WS0_Pos)) /* Assigment of value for WS0 in the XDMAC_GWS register */
#define XDMAC_GWS_WS1_Pos                     _UINT32_(1)                                          /* (XDMAC_GWS) XDMAC Channel 1 Write Suspend Bit Position */
#define XDMAC_GWS_WS1_Msk                     (_UINT32_(0x1) << XDMAC_GWS_WS1_Pos)                 /* (XDMAC_GWS) XDMAC Channel 1 Write Suspend Bit Mask */
#define XDMAC_GWS_WS1(value)                  (XDMAC_GWS_WS1_Msk & (_UINT32_(value) << XDMAC_GWS_WS1_Pos)) /* Assigment of value for WS1 in the XDMAC_GWS register */
#define XDMAC_GWS_WS2_Pos                     _UINT32_(2)                                          /* (XDMAC_GWS) XDMAC Channel 2 Write Suspend Bit Position */
#define XDMAC_GWS_WS2_Msk                     (_UINT32_(0x1) << XDMAC_GWS_WS2_Pos)                 /* (XDMAC_GWS) XDMAC Channel 2 Write Suspend Bit Mask */
#define XDMAC_GWS_WS2(value)                  (XDMAC_GWS_WS2_Msk & (_UINT32_(value) << XDMAC_GWS_WS2_Pos)) /* Assigment of value for WS2 in the XDMAC_GWS register */
#define XDMAC_GWS_WS3_Pos                     _UINT32_(3)                                          /* (XDMAC_GWS) XDMAC Channel 3 Write Suspend Bit Position */
#define XDMAC_GWS_WS3_Msk                     (_UINT32_(0x1) << XDMAC_GWS_WS3_Pos)                 /* (XDMAC_GWS) XDMAC Channel 3 Write Suspend Bit Mask */
#define XDMAC_GWS_WS3(value)                  (XDMAC_GWS_WS3_Msk & (_UINT32_(value) << XDMAC_GWS_WS3_Pos)) /* Assigment of value for WS3 in the XDMAC_GWS register */
#define XDMAC_GWS_WS4_Pos                     _UINT32_(4)                                          /* (XDMAC_GWS) XDMAC Channel 4 Write Suspend Bit Position */
#define XDMAC_GWS_WS4_Msk                     (_UINT32_(0x1) << XDMAC_GWS_WS4_Pos)                 /* (XDMAC_GWS) XDMAC Channel 4 Write Suspend Bit Mask */
#define XDMAC_GWS_WS4(value)                  (XDMAC_GWS_WS4_Msk & (_UINT32_(value) << XDMAC_GWS_WS4_Pos)) /* Assigment of value for WS4 in the XDMAC_GWS register */
#define XDMAC_GWS_WS5_Pos                     _UINT32_(5)                                          /* (XDMAC_GWS) XDMAC Channel 5 Write Suspend Bit Position */
#define XDMAC_GWS_WS5_Msk                     (_UINT32_(0x1) << XDMAC_GWS_WS5_Pos)                 /* (XDMAC_GWS) XDMAC Channel 5 Write Suspend Bit Mask */
#define XDMAC_GWS_WS5(value)                  (XDMAC_GWS_WS5_Msk & (_UINT32_(value) << XDMAC_GWS_WS5_Pos)) /* Assigment of value for WS5 in the XDMAC_GWS register */
#define XDMAC_GWS_WS6_Pos                     _UINT32_(6)                                          /* (XDMAC_GWS) XDMAC Channel 6 Write Suspend Bit Position */
#define XDMAC_GWS_WS6_Msk                     (_UINT32_(0x1) << XDMAC_GWS_WS6_Pos)                 /* (XDMAC_GWS) XDMAC Channel 6 Write Suspend Bit Mask */
#define XDMAC_GWS_WS6(value)                  (XDMAC_GWS_WS6_Msk & (_UINT32_(value) << XDMAC_GWS_WS6_Pos)) /* Assigment of value for WS6 in the XDMAC_GWS register */
#define XDMAC_GWS_WS7_Pos                     _UINT32_(7)                                          /* (XDMAC_GWS) XDMAC Channel 7 Write Suspend Bit Position */
#define XDMAC_GWS_WS7_Msk                     (_UINT32_(0x1) << XDMAC_GWS_WS7_Pos)                 /* (XDMAC_GWS) XDMAC Channel 7 Write Suspend Bit Mask */
#define XDMAC_GWS_WS7(value)                  (XDMAC_GWS_WS7_Msk & (_UINT32_(value) << XDMAC_GWS_WS7_Pos)) /* Assigment of value for WS7 in the XDMAC_GWS register */
#define XDMAC_GWS_WS8_Pos                     _UINT32_(8)                                          /* (XDMAC_GWS) XDMAC Channel 8 Write Suspend Bit Position */
#define XDMAC_GWS_WS8_Msk                     (_UINT32_(0x1) << XDMAC_GWS_WS8_Pos)                 /* (XDMAC_GWS) XDMAC Channel 8 Write Suspend Bit Mask */
#define XDMAC_GWS_WS8(value)                  (XDMAC_GWS_WS8_Msk & (_UINT32_(value) << XDMAC_GWS_WS8_Pos)) /* Assigment of value for WS8 in the XDMAC_GWS register */
#define XDMAC_GWS_WS9_Pos                     _UINT32_(9)                                          /* (XDMAC_GWS) XDMAC Channel 9 Write Suspend Bit Position */
#define XDMAC_GWS_WS9_Msk                     (_UINT32_(0x1) << XDMAC_GWS_WS9_Pos)                 /* (XDMAC_GWS) XDMAC Channel 9 Write Suspend Bit Mask */
#define XDMAC_GWS_WS9(value)                  (XDMAC_GWS_WS9_Msk & (_UINT32_(value) << XDMAC_GWS_WS9_Pos)) /* Assigment of value for WS9 in the XDMAC_GWS register */
#define XDMAC_GWS_WS10_Pos                    _UINT32_(10)                                         /* (XDMAC_GWS) XDMAC Channel 10 Write Suspend Bit Position */
#define XDMAC_GWS_WS10_Msk                    (_UINT32_(0x1) << XDMAC_GWS_WS10_Pos)                /* (XDMAC_GWS) XDMAC Channel 10 Write Suspend Bit Mask */
#define XDMAC_GWS_WS10(value)                 (XDMAC_GWS_WS10_Msk & (_UINT32_(value) << XDMAC_GWS_WS10_Pos)) /* Assigment of value for WS10 in the XDMAC_GWS register */
#define XDMAC_GWS_WS11_Pos                    _UINT32_(11)                                         /* (XDMAC_GWS) XDMAC Channel 11 Write Suspend Bit Position */
#define XDMAC_GWS_WS11_Msk                    (_UINT32_(0x1) << XDMAC_GWS_WS11_Pos)                /* (XDMAC_GWS) XDMAC Channel 11 Write Suspend Bit Mask */
#define XDMAC_GWS_WS11(value)                 (XDMAC_GWS_WS11_Msk & (_UINT32_(value) << XDMAC_GWS_WS11_Pos)) /* Assigment of value for WS11 in the XDMAC_GWS register */
#define XDMAC_GWS_WS12_Pos                    _UINT32_(12)                                         /* (XDMAC_GWS) XDMAC Channel 12 Write Suspend Bit Position */
#define XDMAC_GWS_WS12_Msk                    (_UINT32_(0x1) << XDMAC_GWS_WS12_Pos)                /* (XDMAC_GWS) XDMAC Channel 12 Write Suspend Bit Mask */
#define XDMAC_GWS_WS12(value)                 (XDMAC_GWS_WS12_Msk & (_UINT32_(value) << XDMAC_GWS_WS12_Pos)) /* Assigment of value for WS12 in the XDMAC_GWS register */
#define XDMAC_GWS_WS13_Pos                    _UINT32_(13)                                         /* (XDMAC_GWS) XDMAC Channel 13 Write Suspend Bit Position */
#define XDMAC_GWS_WS13_Msk                    (_UINT32_(0x1) << XDMAC_GWS_WS13_Pos)                /* (XDMAC_GWS) XDMAC Channel 13 Write Suspend Bit Mask */
#define XDMAC_GWS_WS13(value)                 (XDMAC_GWS_WS13_Msk & (_UINT32_(value) << XDMAC_GWS_WS13_Pos)) /* Assigment of value for WS13 in the XDMAC_GWS register */
#define XDMAC_GWS_WS14_Pos                    _UINT32_(14)                                         /* (XDMAC_GWS) XDMAC Channel 14 Write Suspend Bit Position */
#define XDMAC_GWS_WS14_Msk                    (_UINT32_(0x1) << XDMAC_GWS_WS14_Pos)                /* (XDMAC_GWS) XDMAC Channel 14 Write Suspend Bit Mask */
#define XDMAC_GWS_WS14(value)                 (XDMAC_GWS_WS14_Msk & (_UINT32_(value) << XDMAC_GWS_WS14_Pos)) /* Assigment of value for WS14 in the XDMAC_GWS register */
#define XDMAC_GWS_WS15_Pos                    _UINT32_(15)                                         /* (XDMAC_GWS) XDMAC Channel 15 Write Suspend Bit Position */
#define XDMAC_GWS_WS15_Msk                    (_UINT32_(0x1) << XDMAC_GWS_WS15_Pos)                /* (XDMAC_GWS) XDMAC Channel 15 Write Suspend Bit Mask */
#define XDMAC_GWS_WS15(value)                 (XDMAC_GWS_WS15_Msk & (_UINT32_(value) << XDMAC_GWS_WS15_Pos)) /* Assigment of value for WS15 in the XDMAC_GWS register */
#define XDMAC_GWS_Msk                         _UINT32_(0x0000FFFF)                                 /* (XDMAC_GWS) Register Mask  */

#define XDMAC_GWS_WS_Pos                      _UINT32_(0)                                          /* (XDMAC_GWS Position) XDMAC Channel x5 Write Suspend Bit */
#define XDMAC_GWS_WS_Msk                      (_UINT32_(0xFFFF) << XDMAC_GWS_WS_Pos)               /* (XDMAC_GWS Mask) WS */
#define XDMAC_GWS_WS(value)                   (XDMAC_GWS_WS_Msk & (_UINT32_(value) << XDMAC_GWS_WS_Pos)) 

/* -------- XDMAC_GRWS : (XDMAC Offset: 0x30) ( /W 32) Global Channel Read Write Suspend Register -------- */
#define XDMAC_GRWS_RWS0_Pos                   _UINT32_(0)                                          /* (XDMAC_GRWS) XDMAC Channel 0 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS0_Msk                   (_UINT32_(0x1) << XDMAC_GRWS_RWS0_Pos)               /* (XDMAC_GRWS) XDMAC Channel 0 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS0(value)                (XDMAC_GRWS_RWS0_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS0_Pos)) /* Assigment of value for RWS0 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS1_Pos                   _UINT32_(1)                                          /* (XDMAC_GRWS) XDMAC Channel 1 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS1_Msk                   (_UINT32_(0x1) << XDMAC_GRWS_RWS1_Pos)               /* (XDMAC_GRWS) XDMAC Channel 1 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS1(value)                (XDMAC_GRWS_RWS1_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS1_Pos)) /* Assigment of value for RWS1 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS2_Pos                   _UINT32_(2)                                          /* (XDMAC_GRWS) XDMAC Channel 2 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS2_Msk                   (_UINT32_(0x1) << XDMAC_GRWS_RWS2_Pos)               /* (XDMAC_GRWS) XDMAC Channel 2 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS2(value)                (XDMAC_GRWS_RWS2_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS2_Pos)) /* Assigment of value for RWS2 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS3_Pos                   _UINT32_(3)                                          /* (XDMAC_GRWS) XDMAC Channel 3 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS3_Msk                   (_UINT32_(0x1) << XDMAC_GRWS_RWS3_Pos)               /* (XDMAC_GRWS) XDMAC Channel 3 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS3(value)                (XDMAC_GRWS_RWS3_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS3_Pos)) /* Assigment of value for RWS3 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS4_Pos                   _UINT32_(4)                                          /* (XDMAC_GRWS) XDMAC Channel 4 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS4_Msk                   (_UINT32_(0x1) << XDMAC_GRWS_RWS4_Pos)               /* (XDMAC_GRWS) XDMAC Channel 4 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS4(value)                (XDMAC_GRWS_RWS4_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS4_Pos)) /* Assigment of value for RWS4 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS5_Pos                   _UINT32_(5)                                          /* (XDMAC_GRWS) XDMAC Channel 5 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS5_Msk                   (_UINT32_(0x1) << XDMAC_GRWS_RWS5_Pos)               /* (XDMAC_GRWS) XDMAC Channel 5 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS5(value)                (XDMAC_GRWS_RWS5_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS5_Pos)) /* Assigment of value for RWS5 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS6_Pos                   _UINT32_(6)                                          /* (XDMAC_GRWS) XDMAC Channel 6 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS6_Msk                   (_UINT32_(0x1) << XDMAC_GRWS_RWS6_Pos)               /* (XDMAC_GRWS) XDMAC Channel 6 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS6(value)                (XDMAC_GRWS_RWS6_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS6_Pos)) /* Assigment of value for RWS6 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS7_Pos                   _UINT32_(7)                                          /* (XDMAC_GRWS) XDMAC Channel 7 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS7_Msk                   (_UINT32_(0x1) << XDMAC_GRWS_RWS7_Pos)               /* (XDMAC_GRWS) XDMAC Channel 7 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS7(value)                (XDMAC_GRWS_RWS7_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS7_Pos)) /* Assigment of value for RWS7 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS8_Pos                   _UINT32_(8)                                          /* (XDMAC_GRWS) XDMAC Channel 8 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS8_Msk                   (_UINT32_(0x1) << XDMAC_GRWS_RWS8_Pos)               /* (XDMAC_GRWS) XDMAC Channel 8 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS8(value)                (XDMAC_GRWS_RWS8_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS8_Pos)) /* Assigment of value for RWS8 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS9_Pos                   _UINT32_(9)                                          /* (XDMAC_GRWS) XDMAC Channel 9 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS9_Msk                   (_UINT32_(0x1) << XDMAC_GRWS_RWS9_Pos)               /* (XDMAC_GRWS) XDMAC Channel 9 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS9(value)                (XDMAC_GRWS_RWS9_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS9_Pos)) /* Assigment of value for RWS9 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS10_Pos                  _UINT32_(10)                                         /* (XDMAC_GRWS) XDMAC Channel 10 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS10_Msk                  (_UINT32_(0x1) << XDMAC_GRWS_RWS10_Pos)              /* (XDMAC_GRWS) XDMAC Channel 10 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS10(value)               (XDMAC_GRWS_RWS10_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS10_Pos)) /* Assigment of value for RWS10 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS11_Pos                  _UINT32_(11)                                         /* (XDMAC_GRWS) XDMAC Channel 11 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS11_Msk                  (_UINT32_(0x1) << XDMAC_GRWS_RWS11_Pos)              /* (XDMAC_GRWS) XDMAC Channel 11 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS11(value)               (XDMAC_GRWS_RWS11_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS11_Pos)) /* Assigment of value for RWS11 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS12_Pos                  _UINT32_(12)                                         /* (XDMAC_GRWS) XDMAC Channel 12 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS12_Msk                  (_UINT32_(0x1) << XDMAC_GRWS_RWS12_Pos)              /* (XDMAC_GRWS) XDMAC Channel 12 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS12(value)               (XDMAC_GRWS_RWS12_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS12_Pos)) /* Assigment of value for RWS12 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS13_Pos                  _UINT32_(13)                                         /* (XDMAC_GRWS) XDMAC Channel 13 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS13_Msk                  (_UINT32_(0x1) << XDMAC_GRWS_RWS13_Pos)              /* (XDMAC_GRWS) XDMAC Channel 13 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS13(value)               (XDMAC_GRWS_RWS13_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS13_Pos)) /* Assigment of value for RWS13 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS14_Pos                  _UINT32_(14)                                         /* (XDMAC_GRWS) XDMAC Channel 14 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS14_Msk                  (_UINT32_(0x1) << XDMAC_GRWS_RWS14_Pos)              /* (XDMAC_GRWS) XDMAC Channel 14 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS14(value)               (XDMAC_GRWS_RWS14_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS14_Pos)) /* Assigment of value for RWS14 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS15_Pos                  _UINT32_(15)                                         /* (XDMAC_GRWS) XDMAC Channel 15 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS15_Msk                  (_UINT32_(0x1) << XDMAC_GRWS_RWS15_Pos)              /* (XDMAC_GRWS) XDMAC Channel 15 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS15(value)               (XDMAC_GRWS_RWS15_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS15_Pos)) /* Assigment of value for RWS15 in the XDMAC_GRWS register */
#define XDMAC_GRWS_Msk                        _UINT32_(0x0000FFFF)                                 /* (XDMAC_GRWS) Register Mask  */

#define XDMAC_GRWS_RWS_Pos                    _UINT32_(0)                                          /* (XDMAC_GRWS Position) XDMAC Channel x5 Read Write Suspend Bit */
#define XDMAC_GRWS_RWS_Msk                    (_UINT32_(0xFFFF) << XDMAC_GRWS_RWS_Pos)             /* (XDMAC_GRWS Mask) RWS */
#define XDMAC_GRWS_RWS(value)                 (XDMAC_GRWS_RWS_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS_Pos)) 

