Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_serial_flash/firmware/src/packs/ATSAMA5D29_DFP/component/xdmac.h
/* -------- XDMAC_GRWR : (XDMAC Offset: 0x34) ( /W 32) Global Channel Read Write Resume Register -------- */
#define XDMAC_GRWR_RWR0_Pos                   _UINT32_(0)                                          /* (XDMAC_GRWR) XDMAC Channel 0 Read Write Resume Bit Position */
#define XDMAC_GRWR_RWR0_Msk                   (_UINT32_(0x1) << XDMAC_GRWR_RWR0_Pos)               /* (XDMAC_GRWR) XDMAC Channel 0 Read Write Resume Bit Mask */
#define XDMAC_GRWR_RWR0(value)                (XDMAC_GRWR_RWR0_Msk & (_UINT32_(value) << XDMAC_GRWR_RWR0_Pos)) /* Assigment of value for RWR0 in the XDMAC_GRWR register */
#define XDMAC_GRWR_RWR1_Pos                   _UINT32_(1)                                          /* (XDMAC_GRWR) XDMAC Channel 1 Read Write Resume Bit Position */
#define XDMAC_GRWR_RWR1_Msk                   (_UINT32_(0x1) << XDMAC_GRWR_RWR1_Pos)               /* (XDMAC_GRWR) XDMAC Channel 1 Read Write Resume Bit Mask */
#define XDMAC_GRWR_RWR1(value)                (XDMAC_GRWR_RWR1_Msk & (_UINT32_(value) << XDMAC_GRWR_RWR1_Pos)) /* Assigment of value for RWR1 in the XDMAC_GRWR register */
#define XDMAC_GRWR_RWR2_Pos                   _UINT32_(2)                                          /* (XDMAC_GRWR) XDMAC Channel 2 Read Write Resume Bit Position */
#define XDMAC_GRWR_RWR2_Msk                   (_UINT32_(0x1) << XDMAC_GRWR_RWR2_Pos)               /* (XDMAC_GRWR) XDMAC Channel 2 Read Write Resume Bit Mask */
#define XDMAC_GRWR_RWR2(value)                (XDMAC_GRWR_RWR2_Msk & (_UINT32_(value) << XDMAC_GRWR_RWR2_Pos)) /* Assigment of value for RWR2 in the XDMAC_GRWR register */
#define XDMAC_GRWR_RWR3_Pos                   _UINT32_(3)                                          /* (XDMAC_GRWR) XDMAC Channel 3 Read Write Resume Bit Position */
#define XDMAC_GRWR_RWR3_Msk                   (_UINT32_(0x1) << XDMAC_GRWR_RWR3_Pos)               /* (XDMAC_GRWR) XDMAC Channel 3 Read Write Resume Bit Mask */
#define XDMAC_GRWR_RWR3(value)                (XDMAC_GRWR_RWR3_Msk & (_UINT32_(value) << XDMAC_GRWR_RWR3_Pos)) /* Assigment of value for RWR3 in the XDMAC_GRWR register */
#define XDMAC_GRWR_RWR4_Pos                   _UINT32_(4)                                          /* (XDMAC_GRWR) XDMAC Channel 4 Read Write Resume Bit Position */
#define XDMAC_GRWR_RWR4_Msk                   (_UINT32_(0x1) << XDMAC_GRWR_RWR4_Pos)               /* (XDMAC_GRWR) XDMAC Channel 4 Read Write Resume Bit Mask */
#define XDMAC_GRWR_RWR4(value)                (XDMAC_GRWR_RWR4_Msk & (_UINT32_(value) << XDMAC_GRWR_RWR4_Pos)) /* Assigment of value for RWR4 in the XDMAC_GRWR register */
#define XDMAC_GRWR_RWR5_Pos                   _UINT32_(5)                                          /* (XDMAC_GRWR) XDMAC Channel 5 Read Write Resume Bit Position */
#define XDMAC_GRWR_RWR5_Msk                   (_UINT32_(0x1) << XDMAC_GRWR_RWR5_Pos)               /* (XDMAC_GRWR) XDMAC Channel 5 Read Write Resume Bit Mask */
#define XDMAC_GRWR_RWR5(value)                (XDMAC_GRWR_RWR5_Msk & (_UINT32_(value) << XDMAC_GRWR_RWR5_Pos)) /* Assigment of value for RWR5 in the XDMAC_GRWR register */
#define XDMAC_GRWR_RWR6_Pos                   _UINT32_(6)                                          /* (XDMAC_GRWR) XDMAC Channel 6 Read Write Resume Bit Position */
#define XDMAC_GRWR_RWR6_Msk                   (_UINT32_(0x1) << XDMAC_GRWR_RWR6_Pos)               /* (XDMAC_GRWR) XDMAC Channel 6 Read Write Resume Bit Mask */
#define XDMAC_GRWR_RWR6(value)                (XDMAC_GRWR_RWR6_Msk & (_UINT32_(value) << XDMAC_GRWR_RWR6_Pos)) /* Assigment of value for RWR6 in the XDMAC_GRWR register */
#define XDMAC_GRWR_RWR7_Pos                   _UINT32_(7)                                          /* (XDMAC_GRWR) XDMAC Channel 7 Read Write Resume Bit Position */
#define XDMAC_GRWR_RWR7_Msk                   (_UINT32_(0x1) << XDMAC_GRWR_RWR7_Pos)               /* (XDMAC_GRWR) XDMAC Channel 7 Read Write Resume Bit Mask */
#define XDMAC_GRWR_RWR7(value)                (XDMAC_GRWR_RWR7_Msk & (_UINT32_(value) << XDMAC_GRWR_RWR7_Pos)) /* Assigment of value for RWR7 in the XDMAC_GRWR register */
#define XDMAC_GRWR_RWR8_Pos                   _UINT32_(8)                                          /* (XDMAC_GRWR) XDMAC Channel 8 Read Write Resume Bit Position */
#define XDMAC_GRWR_RWR8_Msk                   (_UINT32_(0x1) << XDMAC_GRWR_RWR8_Pos)               /* (XDMAC_GRWR) XDMAC Channel 8 Read Write Resume Bit Mask */
#define XDMAC_GRWR_RWR8(value)                (XDMAC_GRWR_RWR8_Msk & (_UINT32_(value) << XDMAC_GRWR_RWR8_Pos)) /* Assigment of value for RWR8 in the XDMAC_GRWR register */
#define XDMAC_GRWR_RWR9_Pos                   _UINT32_(9)                                          /* (XDMAC_GRWR) XDMAC Channel 9 Read Write Resume Bit Position */
#define XDMAC_GRWR_RWR9_Msk                   (_UINT32_(0x1) << XDMAC_GRWR_RWR9_Pos)               /* (XDMAC_GRWR) XDMAC Channel 9 Read Write Resume Bit Mask */
#define XDMAC_GRWR_RWR9(value)                (XDMAC_GRWR_RWR9_Msk & (_UINT32_(value) << XDMAC_GRWR_RWR9_Pos)) /* Assigment of value for RWR9 in the XDMAC_GRWR register */
#define XDMAC_GRWR_RWR10_Pos                  _UINT32_(10)                                         /* (XDMAC_GRWR) XDMAC Channel 10 Read Write Resume Bit Position */
#define XDMAC_GRWR_RWR10_Msk                  (_UINT32_(0x1) << XDMAC_GRWR_RWR10_Pos)              /* (XDMAC_GRWR) XDMAC Channel 10 Read Write Resume Bit Mask */
#define XDMAC_GRWR_RWR10(value)               (XDMAC_GRWR_RWR10_Msk & (_UINT32_(value) << XDMAC_GRWR_RWR10_Pos)) /* Assigment of value for RWR10 in the XDMAC_GRWR register */
#define XDMAC_GRWR_RWR11_Pos                  _UINT32_(11)                                         /* (XDMAC_GRWR) XDMAC Channel 11 Read Write Resume Bit Position */
#define XDMAC_GRWR_RWR11_Msk                  (_UINT32_(0x1) << XDMAC_GRWR_RWR11_Pos)              /* (XDMAC_GRWR) XDMAC Channel 11 Read Write Resume Bit Mask */
#define XDMAC_GRWR_RWR11(value)               (XDMAC_GRWR_RWR11_Msk & (_UINT32_(value) << XDMAC_GRWR_RWR11_Pos)) /* Assigment of value for RWR11 in the XDMAC_GRWR register */
#define XDMAC_GRWR_RWR12_Pos                  _UINT32_(12)                                         /* (XDMAC_GRWR) XDMAC Channel 12 Read Write Resume Bit Position */
#define XDMAC_GRWR_RWR12_Msk                  (_UINT32_(0x1) << XDMAC_GRWR_RWR12_Pos)              /* (XDMAC_GRWR) XDMAC Channel 12 Read Write Resume Bit Mask */
#define XDMAC_GRWR_RWR12(value)               (XDMAC_GRWR_RWR12_Msk & (_UINT32_(value) << XDMAC_GRWR_RWR12_Pos)) /* Assigment of value for RWR12 in the XDMAC_GRWR register */
#define XDMAC_GRWR_RWR13_Pos                  _UINT32_(13)                                         /* (XDMAC_GRWR) XDMAC Channel 13 Read Write Resume Bit Position */
#define XDMAC_GRWR_RWR13_Msk                  (_UINT32_(0x1) << XDMAC_GRWR_RWR13_Pos)              /* (XDMAC_GRWR) XDMAC Channel 13 Read Write Resume Bit Mask */
#define XDMAC_GRWR_RWR13(value)               (XDMAC_GRWR_RWR13_Msk & (_UINT32_(value) << XDMAC_GRWR_RWR13_Pos)) /* Assigment of value for RWR13 in the XDMAC_GRWR register */
#define XDMAC_GRWR_RWR14_Pos                  _UINT32_(14)                                         /* (XDMAC_GRWR) XDMAC Channel 14 Read Write Resume Bit Position */
#define XDMAC_GRWR_RWR14_Msk                  (_UINT32_(0x1) << XDMAC_GRWR_RWR14_Pos)              /* (XDMAC_GRWR) XDMAC Channel 14 Read Write Resume Bit Mask */
#define XDMAC_GRWR_RWR14(value)               (XDMAC_GRWR_RWR14_Msk & (_UINT32_(value) << XDMAC_GRWR_RWR14_Pos)) /* Assigment of value for RWR14 in the XDMAC_GRWR register */
#define XDMAC_GRWR_RWR15_Pos                  _UINT32_(15)                                         /* (XDMAC_GRWR) XDMAC Channel 15 Read Write Resume Bit Position */
#define XDMAC_GRWR_RWR15_Msk                  (_UINT32_(0x1) << XDMAC_GRWR_RWR15_Pos)              /* (XDMAC_GRWR) XDMAC Channel 15 Read Write Resume Bit Mask */
#define XDMAC_GRWR_RWR15(value)               (XDMAC_GRWR_RWR15_Msk & (_UINT32_(value) << XDMAC_GRWR_RWR15_Pos)) /* Assigment of value for RWR15 in the XDMAC_GRWR register */
#define XDMAC_GRWR_Msk                        _UINT32_(0x0000FFFF)                                 /* (XDMAC_GRWR) Register Mask  */

#define XDMAC_GRWR_RWR_Pos                    _UINT32_(0)                                          /* (XDMAC_GRWR Position) XDMAC Channel x5 Read Write Resume Bit */
#define XDMAC_GRWR_RWR_Msk                    (_UINT32_(0xFFFF) << XDMAC_GRWR_RWR_Pos)             /* (XDMAC_GRWR Mask) RWR */
#define XDMAC_GRWR_RWR(value)                 (XDMAC_GRWR_RWR_Msk & (_UINT32_(value) << XDMAC_GRWR_RWR_Pos)) 

/* -------- XDMAC_GSWR : (XDMAC Offset: 0x38) ( /W 32) Global Channel Software Request Register -------- */
#define XDMAC_GSWR_SWREQ0_Pos                 _UINT32_(0)                                          /* (XDMAC_GSWR) XDMAC Channel 0 Software Request Bit Position */
#define XDMAC_GSWR_SWREQ0_Msk                 (_UINT32_(0x1) << XDMAC_GSWR_SWREQ0_Pos)             /* (XDMAC_GSWR) XDMAC Channel 0 Software Request Bit Mask */
#define XDMAC_GSWR_SWREQ0(value)              (XDMAC_GSWR_SWREQ0_Msk & (_UINT32_(value) << XDMAC_GSWR_SWREQ0_Pos)) /* Assigment of value for SWREQ0 in the XDMAC_GSWR register */
#define XDMAC_GSWR_SWREQ1_Pos                 _UINT32_(1)                                          /* (XDMAC_GSWR) XDMAC Channel 1 Software Request Bit Position */
#define XDMAC_GSWR_SWREQ1_Msk                 (_UINT32_(0x1) << XDMAC_GSWR_SWREQ1_Pos)             /* (XDMAC_GSWR) XDMAC Channel 1 Software Request Bit Mask */
#define XDMAC_GSWR_SWREQ1(value)              (XDMAC_GSWR_SWREQ1_Msk & (_UINT32_(value) << XDMAC_GSWR_SWREQ1_Pos)) /* Assigment of value for SWREQ1 in the XDMAC_GSWR register */
#define XDMAC_GSWR_SWREQ2_Pos                 _UINT32_(2)                                          /* (XDMAC_GSWR) XDMAC Channel 2 Software Request Bit Position */
#define XDMAC_GSWR_SWREQ2_Msk                 (_UINT32_(0x1) << XDMAC_GSWR_SWREQ2_Pos)             /* (XDMAC_GSWR) XDMAC Channel 2 Software Request Bit Mask */
#define XDMAC_GSWR_SWREQ2(value)              (XDMAC_GSWR_SWREQ2_Msk & (_UINT32_(value) << XDMAC_GSWR_SWREQ2_Pos)) /* Assigment of value for SWREQ2 in the XDMAC_GSWR register */
#define XDMAC_GSWR_SWREQ3_Pos                 _UINT32_(3)                                          /* (XDMAC_GSWR) XDMAC Channel 3 Software Request Bit Position */
#define XDMAC_GSWR_SWREQ3_Msk                 (_UINT32_(0x1) << XDMAC_GSWR_SWREQ3_Pos)             /* (XDMAC_GSWR) XDMAC Channel 3 Software Request Bit Mask */
#define XDMAC_GSWR_SWREQ3(value)              (XDMAC_GSWR_SWREQ3_Msk & (_UINT32_(value) << XDMAC_GSWR_SWREQ3_Pos)) /* Assigment of value for SWREQ3 in the XDMAC_GSWR register */
#define XDMAC_GSWR_SWREQ4_Pos                 _UINT32_(4)                                          /* (XDMAC_GSWR) XDMAC Channel 4 Software Request Bit Position */
#define XDMAC_GSWR_SWREQ4_Msk                 (_UINT32_(0x1) << XDMAC_GSWR_SWREQ4_Pos)             /* (XDMAC_GSWR) XDMAC Channel 4 Software Request Bit Mask */
#define XDMAC_GSWR_SWREQ4(value)              (XDMAC_GSWR_SWREQ4_Msk & (_UINT32_(value) << XDMAC_GSWR_SWREQ4_Pos)) /* Assigment of value for SWREQ4 in the XDMAC_GSWR register */
#define XDMAC_GSWR_SWREQ5_Pos                 _UINT32_(5)                                          /* (XDMAC_GSWR) XDMAC Channel 5 Software Request Bit Position */
#define XDMAC_GSWR_SWREQ5_Msk                 (_UINT32_(0x1) << XDMAC_GSWR_SWREQ5_Pos)             /* (XDMAC_GSWR) XDMAC Channel 5 Software Request Bit Mask */
#define XDMAC_GSWR_SWREQ5(value)              (XDMAC_GSWR_SWREQ5_Msk & (_UINT32_(value) << XDMAC_GSWR_SWREQ5_Pos)) /* Assigment of value for SWREQ5 in the XDMAC_GSWR register */
#define XDMAC_GSWR_SWREQ6_Pos                 _UINT32_(6)                                          /* (XDMAC_GSWR) XDMAC Channel 6 Software Request Bit Position */
#define XDMAC_GSWR_SWREQ6_Msk                 (_UINT32_(0x1) << XDMAC_GSWR_SWREQ6_Pos)             /* (XDMAC_GSWR) XDMAC Channel 6 Software Request Bit Mask */
#define XDMAC_GSWR_SWREQ6(value)              (XDMAC_GSWR_SWREQ6_Msk & (_UINT32_(value) << XDMAC_GSWR_SWREQ6_Pos)) /* Assigment of value for SWREQ6 in the XDMAC_GSWR register */
#define XDMAC_GSWR_SWREQ7_Pos                 _UINT32_(7)                                          /* (XDMAC_GSWR) XDMAC Channel 7 Software Request Bit Position */
#define XDMAC_GSWR_SWREQ7_Msk                 (_UINT32_(0x1) << XDMAC_GSWR_SWREQ7_Pos)             /* (XDMAC_GSWR) XDMAC Channel 7 Software Request Bit Mask */
#define XDMAC_GSWR_SWREQ7(value)              (XDMAC_GSWR_SWREQ7_Msk & (_UINT32_(value) << XDMAC_GSWR_SWREQ7_Pos)) /* Assigment of value for SWREQ7 in the XDMAC_GSWR register */
#define XDMAC_GSWR_SWREQ8_Pos                 _UINT32_(8)                                          /* (XDMAC_GSWR) XDMAC Channel 8 Software Request Bit Position */
#define XDMAC_GSWR_SWREQ8_Msk                 (_UINT32_(0x1) << XDMAC_GSWR_SWREQ8_Pos)             /* (XDMAC_GSWR) XDMAC Channel 8 Software Request Bit Mask */
#define XDMAC_GSWR_SWREQ8(value)              (XDMAC_GSWR_SWREQ8_Msk & (_UINT32_(value) << XDMAC_GSWR_SWREQ8_Pos)) /* Assigment of value for SWREQ8 in the XDMAC_GSWR register */
#define XDMAC_GSWR_SWREQ9_Pos                 _UINT32_(9)                                          /* (XDMAC_GSWR) XDMAC Channel 9 Software Request Bit Position */
#define XDMAC_GSWR_SWREQ9_Msk                 (_UINT32_(0x1) << XDMAC_GSWR_SWREQ9_Pos)             /* (XDMAC_GSWR) XDMAC Channel 9 Software Request Bit Mask */
#define XDMAC_GSWR_SWREQ9(value)              (XDMAC_GSWR_SWREQ9_Msk & (_UINT32_(value) << XDMAC_GSWR_SWREQ9_Pos)) /* Assigment of value for SWREQ9 in the XDMAC_GSWR register */
#define XDMAC_GSWR_SWREQ10_Pos                _UINT32_(10)                                         /* (XDMAC_GSWR) XDMAC Channel 10 Software Request Bit Position */
#define XDMAC_GSWR_SWREQ10_Msk                (_UINT32_(0x1) << XDMAC_GSWR_SWREQ10_Pos)            /* (XDMAC_GSWR) XDMAC Channel 10 Software Request Bit Mask */
#define XDMAC_GSWR_SWREQ10(value)             (XDMAC_GSWR_SWREQ10_Msk & (_UINT32_(value) << XDMAC_GSWR_SWREQ10_Pos)) /* Assigment of value for SWREQ10 in the XDMAC_GSWR register */
#define XDMAC_GSWR_SWREQ11_Pos                _UINT32_(11)                                         /* (XDMAC_GSWR) XDMAC Channel 11 Software Request Bit Position */
#define XDMAC_GSWR_SWREQ11_Msk                (_UINT32_(0x1) << XDMAC_GSWR_SWREQ11_Pos)            /* (XDMAC_GSWR) XDMAC Channel 11 Software Request Bit Mask */
#define XDMAC_GSWR_SWREQ11(value)             (XDMAC_GSWR_SWREQ11_Msk & (_UINT32_(value) << XDMAC_GSWR_SWREQ11_Pos)) /* Assigment of value for SWREQ11 in the XDMAC_GSWR register */
#define XDMAC_GSWR_SWREQ12_Pos                _UINT32_(12)                                         /* (XDMAC_GSWR) XDMAC Channel 12 Software Request Bit Position */
#define XDMAC_GSWR_SWREQ12_Msk                (_UINT32_(0x1) << XDMAC_GSWR_SWREQ12_Pos)            /* (XDMAC_GSWR) XDMAC Channel 12 Software Request Bit Mask */
#define XDMAC_GSWR_SWREQ12(value)             (XDMAC_GSWR_SWREQ12_Msk & (_UINT32_(value) << XDMAC_GSWR_SWREQ12_Pos)) /* Assigment of value for SWREQ12 in the XDMAC_GSWR register */
#define XDMAC_GSWR_SWREQ13_Pos                _UINT32_(13)                                         /* (XDMAC_GSWR) XDMAC Channel 13 Software Request Bit Position */
#define XDMAC_GSWR_SWREQ13_Msk                (_UINT32_(0x1) << XDMAC_GSWR_SWREQ13_Pos)            /* (XDMAC_GSWR) XDMAC Channel 13 Software Request Bit Mask */
#define XDMAC_GSWR_SWREQ13(value)             (XDMAC_GSWR_SWREQ13_Msk & (_UINT32_(value) << XDMAC_GSWR_SWREQ13_Pos)) /* Assigment of value for SWREQ13 in the XDMAC_GSWR register */
#define XDMAC_GSWR_SWREQ14_Pos                _UINT32_(14)                                         /* (XDMAC_GSWR) XDMAC Channel 14 Software Request Bit Position */
#define XDMAC_GSWR_SWREQ14_Msk                (_UINT32_(0x1) << XDMAC_GSWR_SWREQ14_Pos)            /* (XDMAC_GSWR) XDMAC Channel 14 Software Request Bit Mask */
#define XDMAC_GSWR_SWREQ14(value)             (XDMAC_GSWR_SWREQ14_Msk & (_UINT32_(value) << XDMAC_GSWR_SWREQ14_Pos)) /* Assigment of value for SWREQ14 in the XDMAC_GSWR register */
#define XDMAC_GSWR_SWREQ15_Pos                _UINT32_(15)                                         /* (XDMAC_GSWR) XDMAC Channel 15 Software Request Bit Position */
#define XDMAC_GSWR_SWREQ15_Msk                (_UINT32_(0x1) << XDMAC_GSWR_SWREQ15_Pos)            /* (XDMAC_GSWR) XDMAC Channel 15 Software Request Bit Mask */
#define XDMAC_GSWR_SWREQ15(value)             (XDMAC_GSWR_SWREQ15_Msk & (_UINT32_(value) << XDMAC_GSWR_SWREQ15_Pos)) /* Assigment of value for SWREQ15 in the XDMAC_GSWR register */
#define XDMAC_GSWR_Msk                        _UINT32_(0x0000FFFF)                                 /* (XDMAC_GSWR) Register Mask  */

#define XDMAC_GSWR_SWREQ_Pos                  _UINT32_(0)                                          /* (XDMAC_GSWR Position) XDMAC Channel x5 Software Request Bit */
#define XDMAC_GSWR_SWREQ_Msk                  (_UINT32_(0xFFFF) << XDMAC_GSWR_SWREQ_Pos)           /* (XDMAC_GSWR Mask) SWREQ */
#define XDMAC_GSWR_SWREQ(value)               (XDMAC_GSWR_SWREQ_Msk & (_UINT32_(value) << XDMAC_GSWR_SWREQ_Pos)) 

